Конфигурация отчетов/DataProcessors/ПанельУдаленияСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПанельУдаленияСчетов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заведение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Заведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСчета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаУдаления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныОтмен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация отчетов/Enums/СтатусВыполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусВыполнения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОжидании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленаИсполнителю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отложенно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удалена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация отчетов/Documents/ЗапросНаУдалениеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗапросНаУдалениеСчета</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заведение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Заведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтмены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтмен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусВыполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусВыполнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация отчетов/Catalogs/Заведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Заведения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заведение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Заведение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД_Телеграмм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициалы_Выгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Путь_Выгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдрессХоста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищеноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация отчетов/DataProcessors/ПанельУдаленияСчетов/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ДатаСменыПриИзмененииНаСервере()
	Объект.ТЧ.Очистить();
	//загрузка информации
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДневнойОтчетСчетаНаУдаление.НомерСчета КАК НомерСчета,
		|	ДневнойОтчетСчетаНаУдаление.Сумма КАК Сумма,
		|	ДневнойОтчетСчетаНаУдаление.ПричинаОтказа КАК ПричинаОтказа,
		|	ДневнойОтчетСчетаНаУдаление.Коментарий КАК Коментарий,
		|	ДневнойОтчетСчетаНаУдаление.Ссылка.Заведение КАК Заведение,
		|	ДневнойОтчетСчетаНаУдаление.Ссылка.ДатаСмены КАК ДатаСмены
		|ИЗ
		|	Документ.ДневнойОтчет.СчетаНаУдаление КАК ДневнойОтчетСчетаНаУдаление
		|ГДЕ
		|	ДневнойОтчетСчетаНаУдаление.Ссылка.ДатаСмены = &ДатаСмены
		|
		|УПОРЯДОЧИТЬ ПО
		|	Заведение";
	
	Запрос.УстановитьПараметр("ДатаСмены", Объект.ДатаСмены);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Счет = Объект.ТЧ.Добавить();
		Счет.Заведение 		 = Справочники.Заведения.ПолучитьЗаведение(Выборка.Заведение);
		Счет.НомерСчета      = Выборка.НомерСчета;
		Счет.Сумма           = Выборка.Сумма;
		Счет.ПричинаУдаления = Выборка.ПричинаОтказа;
		Счет.Коментарий      = Выборка.Коментарий;

	КонецЦикла;
	
	//проверка на удаление
	
	Для Каждого Счет Из Объект.ТЧ Цикл
		Счет.Статус = Документы.ЗапросНаУдалениеСчета.ПроверкаНаУдалениеСчета(Счет.Заведение, Счет.НомерСчета);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСменыПриИзменении(Элемент)
	ДатаСменыПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТЧСтатусПриИзмененииНаСервере()
	ТекСтрока = Элементы.ТЧ.ТекущаяСтрока;
	ЗначенияСтроки = Объект.ТЧ.НайтиПоИдентификатору(ТекСтрока);
	//Проверк на удаление
	СчетУдален = Документы.ЗапросНаУдалениеСчета.ПроверкаНаУдалениеСчета(ЗначенияСтроки.Заведение, ЗначенияСтроки.НомерСчета);

	//создание документа удаление счета
	Если СчетУдален = Ложь Тогда
		СсылкаНаДокУдаления = Документы.ЗапросНаУдалениеСчета.СоздатьЗаявкуУдаленияСчета(ЗначенияСтроки.Заведение, ЗначенияСтроки.НомерСчета, ЗначенияСтроки.Сумма,
			ЗначенияСтроки.ПричинаУдаления, ЗначенияСтроки.Коментарий, Перечисления.СтатусВыполнения.Завершено); 
	КонецЕсли;
	
	//проверка на доступность удаление на заведение. В данном случае заполнение поля хост определяет доступность.
	Если ЗначениеЗаполнено(ЗначенияСтроки.Заведение.АдрессХоста) = Истина Тогда
		//удаление счета на заведение
		ВВП.УдалитьСчет(ЗначенияСтроки.Заведение, ЗначенияСтроки.НомерСчета); 
	КонецЕсли;

	Если ЗначениеЗаполнено(СсылкаНаДокУдаления) = Истина Тогда
		ЗначенияСтроки.Статус = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧСтатусПриИзменении(Элемент)
	ТЧСтатусПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ДатаСмены = ТекущаяДата();
	ДатаСменыПриИзмененииНаСервере();

КонецПроцедуры
